{"class_name": "Functional", "config": {"name": "attunet_model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": [], "shared_object_id": 0}, {"class_name": "Functional", "config": {"name": "VGG16_backbone", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": [], "shared_object_id": 0}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1_conv2", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv1", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv2", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv1", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv2", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv3", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv1", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv2", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv3", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv1", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv2", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv3", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["block1_conv2", 0, 0], ["block2_conv2", 0, 0], ["block3_conv3", 0, 0], ["block4_conv3", 0, 0], ["block5_conv3", 0, 0]]}, "name": "VGG16_backbone", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "attunet_up0_decode_trans_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "attunet_up0_decode_trans_conv", "inbound_nodes": [[["VGG16_backbone", 1, 4, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "attunet_up0_decode_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "attunet_up0_decode_bn", "inbound_nodes": [[["attunet_up0_decode_trans_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up0_decode_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up0_decode_activation", "inbound_nodes": [[["attunet_up0_decode_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up0_att_theta_x", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up0_att_theta_x", "inbound_nodes": [[["VGG16_backbone", 1, 3, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up0_att_phi_g", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up0_att_phi_g", "inbound_nodes": [[["attunet_up0_decode_activation", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "attunet_up0_att_add", "trainable": true, "dtype": "float32"}, "name": "attunet_up0_att_add", "inbound_nodes": [[["attunet_up0_att_theta_x", 0, 0, {}], ["attunet_up0_att_phi_g", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up0_att_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up0_att_activation", "inbound_nodes": [[["attunet_up0_att_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up0_att_psi_f", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up0_att_psi_f", "inbound_nodes": [[["attunet_up0_att_activation", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "attunet_up0_att_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "attunet_up0_att_sigmoid", "inbound_nodes": [[["attunet_up0_att_psi_f", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "attunet_up0_att_masking", "trainable": true, "dtype": "float32"}, "name": "attunet_up0_att_masking", "inbound_nodes": [[["VGG16_backbone", 1, 3, {}], ["attunet_up0_att_sigmoid", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "attunet_up0_concat", "trainable": true, "dtype": "float32", "axis": -1}, "name": "attunet_up0_concat", "inbound_nodes": [[["attunet_up0_decode_activation", 0, 0, {}], ["attunet_up0_att_masking", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up0_conv_after_concat_0", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up0_conv_after_concat_0", "inbound_nodes": [[["attunet_up0_concat", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "attunet_up0_conv_after_concat_0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "attunet_up0_conv_after_concat_0_bn", "inbound_nodes": [[["attunet_up0_conv_after_concat_0", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up0_conv_after_concat_0_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up0_conv_after_concat_0_activation", "inbound_nodes": [[["attunet_up0_conv_after_concat_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up0_conv_after_concat_1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up0_conv_after_concat_1", "inbound_nodes": [[["attunet_up0_conv_after_concat_0_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "attunet_up0_conv_after_concat_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "attunet_up0_conv_after_concat_1_bn", "inbound_nodes": [[["attunet_up0_conv_after_concat_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up0_conv_after_concat_1_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up0_conv_after_concat_1_activation", "inbound_nodes": [[["attunet_up0_conv_after_concat_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "attunet_up1_decode_trans_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "attunet_up1_decode_trans_conv", "inbound_nodes": [[["attunet_up0_conv_after_concat_1_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "attunet_up1_decode_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "attunet_up1_decode_bn", "inbound_nodes": [[["attunet_up1_decode_trans_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up1_decode_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up1_decode_activation", "inbound_nodes": [[["attunet_up1_decode_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up1_att_theta_x", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up1_att_theta_x", "inbound_nodes": [[["VGG16_backbone", 1, 2, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up1_att_phi_g", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up1_att_phi_g", "inbound_nodes": [[["attunet_up1_decode_activation", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "attunet_up1_att_add", "trainable": true, "dtype": "float32"}, "name": "attunet_up1_att_add", "inbound_nodes": [[["attunet_up1_att_theta_x", 0, 0, {}], ["attunet_up1_att_phi_g", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up1_att_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up1_att_activation", "inbound_nodes": [[["attunet_up1_att_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up1_att_psi_f", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up1_att_psi_f", "inbound_nodes": [[["attunet_up1_att_activation", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "attunet_up1_att_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "attunet_up1_att_sigmoid", "inbound_nodes": [[["attunet_up1_att_psi_f", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "attunet_up1_att_masking", "trainable": true, "dtype": "float32"}, "name": "attunet_up1_att_masking", "inbound_nodes": [[["VGG16_backbone", 1, 2, {}], ["attunet_up1_att_sigmoid", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "attunet_up1_concat", "trainable": true, "dtype": "float32", "axis": -1}, "name": "attunet_up1_concat", "inbound_nodes": [[["attunet_up1_decode_activation", 0, 0, {}], ["attunet_up1_att_masking", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up1_conv_after_concat_0", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up1_conv_after_concat_0", "inbound_nodes": [[["attunet_up1_concat", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "attunet_up1_conv_after_concat_0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "attunet_up1_conv_after_concat_0_bn", "inbound_nodes": [[["attunet_up1_conv_after_concat_0", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up1_conv_after_concat_0_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up1_conv_after_concat_0_activation", "inbound_nodes": [[["attunet_up1_conv_after_concat_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up1_conv_after_concat_1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up1_conv_after_concat_1", "inbound_nodes": [[["attunet_up1_conv_after_concat_0_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "attunet_up1_conv_after_concat_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "attunet_up1_conv_after_concat_1_bn", "inbound_nodes": [[["attunet_up1_conv_after_concat_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up1_conv_after_concat_1_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up1_conv_after_concat_1_activation", "inbound_nodes": [[["attunet_up1_conv_after_concat_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "attunet_up2_decode_trans_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "attunet_up2_decode_trans_conv", "inbound_nodes": [[["attunet_up1_conv_after_concat_1_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "attunet_up2_decode_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "attunet_up2_decode_bn", "inbound_nodes": [[["attunet_up2_decode_trans_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up2_decode_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up2_decode_activation", "inbound_nodes": [[["attunet_up2_decode_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up2_att_theta_x", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up2_att_theta_x", "inbound_nodes": [[["VGG16_backbone", 1, 1, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up2_att_phi_g", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up2_att_phi_g", "inbound_nodes": [[["attunet_up2_decode_activation", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "attunet_up2_att_add", "trainable": true, "dtype": "float32"}, "name": "attunet_up2_att_add", "inbound_nodes": [[["attunet_up2_att_theta_x", 0, 0, {}], ["attunet_up2_att_phi_g", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up2_att_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up2_att_activation", "inbound_nodes": [[["attunet_up2_att_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up2_att_psi_f", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up2_att_psi_f", "inbound_nodes": [[["attunet_up2_att_activation", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "attunet_up2_att_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "attunet_up2_att_sigmoid", "inbound_nodes": [[["attunet_up2_att_psi_f", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "attunet_up2_att_masking", "trainable": true, "dtype": "float32"}, "name": "attunet_up2_att_masking", "inbound_nodes": [[["VGG16_backbone", 1, 1, {}], ["attunet_up2_att_sigmoid", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "attunet_up2_concat", "trainable": true, "dtype": "float32", "axis": -1}, "name": "attunet_up2_concat", "inbound_nodes": [[["attunet_up2_decode_activation", 0, 0, {}], ["attunet_up2_att_masking", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up2_conv_after_concat_0", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up2_conv_after_concat_0", "inbound_nodes": [[["attunet_up2_concat", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "attunet_up2_conv_after_concat_0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "attunet_up2_conv_after_concat_0_bn", "inbound_nodes": [[["attunet_up2_conv_after_concat_0", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up2_conv_after_concat_0_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up2_conv_after_concat_0_activation", "inbound_nodes": [[["attunet_up2_conv_after_concat_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up2_conv_after_concat_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up2_conv_after_concat_1", "inbound_nodes": [[["attunet_up2_conv_after_concat_0_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "attunet_up2_conv_after_concat_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "attunet_up2_conv_after_concat_1_bn", "inbound_nodes": [[["attunet_up2_conv_after_concat_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up2_conv_after_concat_1_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up2_conv_after_concat_1_activation", "inbound_nodes": [[["attunet_up2_conv_after_concat_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "attunet_up3_decode_trans_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "attunet_up3_decode_trans_conv", "inbound_nodes": [[["attunet_up2_conv_after_concat_1_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "attunet_up3_decode_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "attunet_up3_decode_bn", "inbound_nodes": [[["attunet_up3_decode_trans_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up3_decode_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up3_decode_activation", "inbound_nodes": [[["attunet_up3_decode_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up3_att_theta_x", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up3_att_theta_x", "inbound_nodes": [[["VGG16_backbone", 1, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up3_att_phi_g", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up3_att_phi_g", "inbound_nodes": [[["attunet_up3_decode_activation", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "attunet_up3_att_add", "trainable": true, "dtype": "float32"}, "name": "attunet_up3_att_add", "inbound_nodes": [[["attunet_up3_att_theta_x", 0, 0, {}], ["attunet_up3_att_phi_g", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up3_att_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up3_att_activation", "inbound_nodes": [[["attunet_up3_att_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up3_att_psi_f", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up3_att_psi_f", "inbound_nodes": [[["attunet_up3_att_activation", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "attunet_up3_att_sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "attunet_up3_att_sigmoid", "inbound_nodes": [[["attunet_up3_att_psi_f", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "attunet_up3_att_masking", "trainable": true, "dtype": "float32"}, "name": "attunet_up3_att_masking", "inbound_nodes": [[["VGG16_backbone", 1, 0, {}], ["attunet_up3_att_sigmoid", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "attunet_up3_concat", "trainable": true, "dtype": "float32", "axis": -1}, "name": "attunet_up3_concat", "inbound_nodes": [[["attunet_up3_decode_activation", 0, 0, {}], ["attunet_up3_att_masking", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up3_conv_after_concat_0", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up3_conv_after_concat_0", "inbound_nodes": [[["attunet_up3_concat", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "attunet_up3_conv_after_concat_0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "attunet_up3_conv_after_concat_0_bn", "inbound_nodes": [[["attunet_up3_conv_after_concat_0", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up3_conv_after_concat_0_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up3_conv_after_concat_0_activation", "inbound_nodes": [[["attunet_up3_conv_after_concat_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_up3_conv_after_concat_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_up3_conv_after_concat_1", "inbound_nodes": [[["attunet_up3_conv_after_concat_0_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "attunet_up3_conv_after_concat_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "attunet_up3_conv_after_concat_1_bn", "inbound_nodes": [[["attunet_up3_conv_after_concat_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "attunet_up3_conv_after_concat_1_activation", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "attunet_up3_conv_after_concat_1_activation", "inbound_nodes": [[["attunet_up3_conv_after_concat_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "attunet_output", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attunet_output", "inbound_nodes": [[["attunet_up3_conv_after_concat_1_activation", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "attunet_output_activation", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "attunet_output_activation", "inbound_nodes": [[["attunet_output", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["attunet_output_activation", 0, 0]]}, "keras_version": "2.12.0", "backend": "tensorflow"}